{
  "Deutsche Börse AG": {
    "name": "Deutsche Börse AG",
    "auditor": "KPMG",
    "matters": {
      "2017": [
        {
          "title": "Impairment of the Goodwill",
          "description": "At 31 December 2017, goodwill amounted to EUR 2,770.9 million (previous year: EUR 2,721.1 million), representing 2 per cent of the assets of the Group. Goodwill is subjected to an impairment test at least annually and on an ad hoc basis if necessary. The impairment test involves comparing the carryi...",
          "riskLevel": "High",
          "auditResponse": "The auditors reviewed the assumptions and methodologies used in the impairment testing process, including the valuation models and inputs. They also evaluated the appropriateness of the discount rates..."
        },
        {
          "title": "Valuation of Other Intangible Assets",
          "description": "The other intangible assets amounted to EUR 911.2 million (previous year: EUR 859.9 million) at 31 December 2017, representing 0.7% of the Group's assets. These assets are subject to annual impairment tests, and their valuation is highly dependent on assumptions about future cash inflows and defined...",
          "riskLevel": "High",
          "auditResponse": "The auditors assessed the valuation models and the appropriateness of significant assumptions, including the discount rates, by comparing them with market and industry-specific reference values. They ..."
        },
        {
          "title": "Valuation of Provisions for Tax Risks",
          "description": "The provisions for tax risks amounted to EUR 339.4 million at 31 December 2017. The application of local and international tax regulations and tax relief is complex and associated with risks. The calculation of tax provisions requires the company to exercise judgment in the assessment of tax issues ...",
          "riskLevel": "High",
          "auditResponse": "With the support of our employees specialising in local and international tax law, we appraised the tax calculation, including the risk assessment, of Deutsche Börse AG. Where available, we have also ..."
        }
      ],
      "2018": [
        {
          "title": "Impairment of Other Intangible Assets",
          "description": "The other intangible assets amounted to EUR 952.7 million (previous year: EUR 911.2 million) at 31 December 2018, representing 0.6% of the Group's assets. These assets are subject to an annual impairment test, which is highly dependent on assumptions about future cash inflows and defined parameters....",
          "riskLevel": "High",
          "auditResponse": "The audit team, supported by valuation experts, assessed the valuation models and the appropriateness of significant assumptions. They compared the assumptions with market and industry-specific refere..."
        },
        {
          "title": "Impairment of the goodwill",
          "description": "At 31 December 2018, goodwill amounted to EUR 2,865.6 million (previous year: EUR 2,770.9 million). Goodwill is subjected to an impairment test by the company at least once a year and also on an ad hoc basis, if appropriate. The carrying amount is compared with the recoverable amount of the cash-gen...",
          "riskLevel": "High",
          "auditResponse": "The audit team focused on the assumptions and methodologies used in the impairment testing of goodwill, including the valuation models and the forecasted cash flows. They performed sensitivity analyse..."
        },
        {
          "title": "Valuation of Provisions for Tax Risks",
          "description": "The company operates in various jurisdictions with different legal systems, leading to complex applications of local and international tax regulations and tax relief. This complexity introduces significant risks, requiring the company to make judgments and estimates regarding tax risks. The provisio...",
          "riskLevel": "High",
          "auditResponse": "The audit confirmed that the company's calculation methods are appropriate and consistent with relevant valuation principles. The underlying assumptions about valuation-relevant parameters were calcul..."
        }
      ],
      "2019": [
        {
          "title": "Impairment of Goodwill",
          "description": "At 31 December 2019, goodwill amounted to EUR 3,470.5 million (previous year: EUR 2,865.6 million), representing 2.5% of the Group's assets. The company performs an impairment test annually and on an ad hoc basis if necessary, comparing the carrying amount with the recoverable amount of the cash-gen...",
          "riskLevel": "High",
          "auditResponse": "With the support of valuation experts, the auditors assessed the valuation models and the appropriateness of significant assumptions. They compared the discount rates with market and industry-specific..."
        },
        {
          "title": "Impairment of Other Intangible Assets",
          "description": "At 31 December 2019, other intangible assets amounted to EUR 1,040.9 million (previous year: EUR 952.7 million), representing 0.8% of the Group’s assets. These assets are subject to an annual impairment test, which is highly dependent on assumptions about future cash inflows and defined parameters. ...",
          "riskLevel": "High",
          "auditResponse": "With the support of valuation experts, the auditors assessed the valuation models and the appropriateness of significant assumptions. They compared the assumptions with market and industry-specific re..."
        },
        {
          "title": "Valuation of Provisions for Tax Risks",
          "description": "The Group operates in a variety of jurisdictions with different legal systems. The provisions for tax risks amounted to €265.9 million at 31 December 2019. The application of local and international tax regulations and tax relief is complex and associated with risks. The calculation of tax provision...",
          "riskLevel": "High",
          "auditResponse": "With the support of our employees specialising in local and international tax law, we appraised the tax calculation, including the risk assessment, of Deutsche Börse AG. Where available, we have also ..."
        }
      ],
      "2020": [
        {
          "title": "Impairment of Other Intangible Assets",
          "description": "At 31 December 2020, other intangible assets amounted to EUR 1,255 million (previous year: EUR 1,041 million), representing 0.8% of the Group’s assets. These assets are subject to an annual impairment test, which is highly dependent on assumptions about future cash inflows and defined parameters. Th...",
          "riskLevel": "High",
          "auditResponse": "With the support of valuation experts, the auditors assessed the valuation models and the appropriateness of significant assumptions. They compared the assumptions with market and industry-specific re..."
        },
        {
          "title": "Impairment Testing of Goodwill",
          "description": "At 31 December 2020, goodwill amounted to EUR 3,958 million (previous year: EUR 3,471 million), representing 2.6 per cent of the Group's assets at 31 December 2019. The company performs an impairment test on goodwill at least annually and on an ad hoc basis if necessary. The impairment test involves...",
          "riskLevel": "High",
          "auditResponse": "With the support of valuation experts, we assessed the valuation models and the appropriateness of significant assumptions related to valuation parameters. We compared the assumptions used in determin..."
        }
      ],
      "2021": [
        {
          "title": "Assessment of Certain Legal Risks",
          "description": "The companies of the Deutsche Börse Group are exposed to certain legal risks, including legal disputes involving Clearstream Banking S.A. with the Iranian Central Bank, an action by the insolvency administrator for the assets of AirBerlin PLC i.I., and an investigation relating to securities transac...",
          "riskLevel": "High",
          "auditResponse": "As part of our audit, we examined the underlying documents to the above-mentioned legal disputes and proceedings, analyzed the legal assessment of Deutsche Börse Group, and assessed the executive dire..."
        }
      ],
      "2022": [
        {
          "title": "Assessment of Certain Legal Risks",
          "description": "The company is exposed to significant legal risks, including litigation by Clearstream Banking S.A. against the Central Bank of Iran for USD 4.9 billion, a claim by the insolvency administrator of Air Berlin PLC i.I. against Clearstream Banking AG for € 498 million, and an investigation into cum ex ...",
          "riskLevel": "High",
          "auditResponse": "As part of our audit, we reviewed the underlying documents, considered the legal disputes and proceedings, and followed the company's legal assessments. We assessed the legal representatives' assessme..."
        },
        {
          "title": "Recoverability of goodwill and other intangible assets",
          "description": "The company's consolidated financial statements include significant amounts of goodwill and other intangible assets, totaling €7,856.3 million (93% of consolidated equity). These assets are tested annually or on an ad hoc basis for impairment. The impairment test involves comparing the carrying amou...",
          "riskLevel": "High",
          "auditResponse": "As part of the audit, the methodology for the impairment test was traced. A risk-oriented approach was taken, involving valuation specialists to compare the future cash flows used in the calculation w..."
        }
      ],
      "2023": [
        {
          "title": "Accounting for the acquisition of SimCorp A/S",
          "description": "Deutsche Börse Aktiengesellschaft acquired the majority of shares in the software service provider SimCorp A/S, Copenhagen, Denmark, through a public takeover bid effective from 29 September 2023. Following further share purchases and the implementation of a squeeze-out under stock corporation law, ...",
          "riskLevel": "High",
          "auditResponse": "We analysed the adjustment of the groups of cash-generating units at whose level goodwill is monitored, which was carried out as part of the SimCorp acquisition. We assessed the disclosures required b..."
        },
        {
          "title": "Assessment of certain legal risks",
          "description": "The company is exposed to certain legal risks, including legal disputes of Clearstream Banking S.A. in connection with the Central Bank of Iran, claims for restitution and damages against the Central Bank of Iran in the amount of USD 4.9 billion (plus interest), and claims by other groups of plainti...",
          "riskLevel": "High",
          "auditResponse": "As part of our audit, we inspected the underlying documents relating to the above-mentioned legal disputes and proceedings and analysed the legal assessments of Deutsche Börse Group. We held regular d..."
        },
        {
          "title": "Recoverability of goodwill and other intangible assets",
          "description": "Goodwill and other intangible assets with definite and indefinite useful lives totalling € 11,248.6 million (116.4 % of Group equity) are reported under the balance sheet item 'Intangible assets'. The other intangible assets relate particularly to stock exchange licences, brand names, and customer r...",
          "riskLevel": "High",
          "auditResponse": "As part of our audit, we first analysed the methodology used to perform the impairment test. In a risk-oriented selection, with the involvement of our valuation specialists, we compared the future cas..."
        }
      ],
      "2024": [
        {
          "title": "Assessment of Legal Risks",
          "description": "The company is exposed to certain legal risks, including legal proceedings by Clearstream Banking S.A. and the insolvency administrator of Air Berlin PLC. These risks are complex and subject to significant uncertainties, potentially impacting the net assets, financial position, and results of operat...",
          "riskLevel": "High",
          "auditResponse": "We inspected the underlying documents relating to the legal disputes, verified the legal assessments of Deutsche Börse Aktiengesellschaft, and held regular discussions with the legal departments. We o..."
        },
        {
          "title": "Recoverability of goodwill and other intangible assets",
          "description": "In the company’s consolidated financial statements, goodwill and other intangible assets with a definite and indefinite useful life totaling €11,323.9 million (105.1% of consolidated equity) are reported under the 'Intangible assets' item. The other intangible assets relate in particular to stock ex...",
          "riskLevel": "High",
          "auditResponse": "As part of our audit, we first verified the methodical approach for conducting the impairment test. In a risk-oriented selection, we involved our valuation specialists and, after comparing the future ..."
        }
      ]
    }
  },
  "Euronext N.V.": {
    "name": "Euronext N.V.",
    "auditor": "PwC",
    "matters": {
      "2015": [
        {
          "title": "Fair Value Measurement of Equity Investments",
          "description": "Euronext owns a direct interest of 3.26% and an indirect interest of 1.49% in Euroclear plc valued at €97 million, and a 2.31% interest in LCH.Clearnet Group Limited plc valued at €18 million. These interests are classified as available-for-sale financial assets with remeasurement to fair value thro...",
          "riskLevel": "High",
          "auditResponse": "We assessed management’s valuation and challenged the key assumptions involving our valuation specialists. We independently developed expectations for the key assumptions driving management’s analysis..."
        },
        {
          "title": "New Systems Implementation",
          "description": "As of 1 January 2015, the company implemented a new IT system for market data activities, followed by the implementation of a new ERP system serving as the key financial application as of 1 August 2015. At the same time, the company revisited the related parts of its internal control framework. Segr...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding of IT general controls to design appropriate audit procedures. We tested the relevant IT general controls and the data migration. We expanded our audit procedures to speci..."
        },
        {
          "title": "Restructuring Provision",
          "description": "A provision of €22 million has been recognized as of 31 December 2015 in relation to two French restructuring plans. Both plans are voluntary and were agreed by the Company with the relevant labor unions in November 2015 and January 2016. The restructuring provisions are material to the financial st...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included challenging and testing the assumptions made by management concerning their calculation of the restructuring provision. We tested the assumptions based on supporting docu..."
        }
      ],
      "2016": [
        {
          "title": "Completeness and accuracy of revenue",
          "description": "Revenue of €496 million consists of Listing, Trading, Market data, Post trade, and Market Solutions and other revenue, generally characterized by high volumes of transactions and relatively low value per transaction. The invoicing and recognition of revenue is highly dependent on automated systems a...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding of IT general controls and automated controls, tested these controls, specifically addressed segregation of duties and potential conflicts, requested external confirmation..."
        },
        {
          "title": "Implications of the move of the UK technology operations from Belfast to Porto",
          "description": "Euronext is in the process of moving its UK technology operations from Belfast to Porto. During 2016, charges of €2.2 million have been recorded in the income statement and a provision of €1.2 million has been recognized as at 31 December 2016 in relation to the Belfast restructuring plan....",
          "riskLevel": "High",
          "auditResponse": "We challenged the assumptions concerning the identification and calculation of restructuring charges, potential impairment of assets, and tax implications. We tested the assumptions through supporting..."
        },
        {
          "title": "Valuation of available-for-sale financial assets",
          "description": "As of 31 December 2016, Euronext owns both a direct and an indirect interest in Euroclear Plc and LCH.Clearnet Group Limited Plc. The determination of the fair value involves significant management judgment and assumptions as the shares are not traded on an active market....",
          "riskLevel": "High",
          "auditResponse": "We assessed management’s valuation, challenged the key assumptions, independently developed expectations for the key assumptions, compared the outcome of our independently developed expectations with ..."
        }
      ],
      "2017": [
        {
          "title": "Accounting for the acquisition of businesses",
          "description": "During 2017 Euronext acquired majority interests in a number of companies. Total considerations were EUR 176 million, of which EUR 19 million is deferred or contingent. The acquisitions have been included in the consolidated financial position and results of Euronext from the moment control was obta...",
          "riskLevel": "High",
          "auditResponse": "We gained an understanding of the material business acquisitions and assessed whether the correct accounting treatment has been applied. Furthermore, we tested the considerations paid and the identifi..."
        },
        {
          "title": "Reliability and continuity of the information technology and systems",
          "description": "A proper IT infrastructure ensures the reliability and continuity of Euronext’s business processes and financial reporting. Euronext continuously invests in improving its IT environment and systems to meet new regulatory requirements under MIFID2 and to develop a new core trading platform. The role ...",
          "riskLevel": "High",
          "auditResponse": "We tested the IT general controls at Euronext related to logical access and change management and application controls embedded in the automated data processing systems. We also assessed the reliabili..."
        },
        {
          "title": "Valuation of available for sale financial assets",
          "description": "Euronext holds a direct and indirect minority interest in Euroclear Plc. This interest is classified as available for sale with re-measurement to fair value through the other comprehensive income component of equity. Euroclear is a non-listed company, and Euronext applies internal models to measure ...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included assessing the methodology and appropriateness of the valuation models against generally accepted market practice and inputs used to value the available for sale financial..."
        }
      ],
      "2018": [
        {
          "title": "Accounting for the Acquisition of Businesses",
          "description": "During 2018, Euronext acquired all shares of the Irish Stock Exchange plc and major stakes in Commcise Ltd and InsiderLog AB. Total considerations were EUR 215 million, of which EUR 4 million is a contingent earn-out payment. The acquisitions have been included in the consolidated financial position...",
          "riskLevel": "High",
          "auditResponse": "We gained an understanding of the material business acquisitions and made an assessment of the process that management has undertaken to determine the allocation of the purchase price, including but n..."
        },
        {
          "title": "Fair Value Measurement of Financial Investments",
          "description": "Euronext holds a direct and an indirect minority interest in Euroclear plc. This interest is classified as a financial asset at fair value through other comprehensive income. As Euroclear is a non-listed company, Euronext applies an internally developed model to estimate the fair value, which since ...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures comprised, among others, an assessment of the methodology and the appropriateness of the valuation model against generally accepted market practice and inputs used to value the in..."
        },
        {
          "title": "Implementation of IFRS 15 Revenue Recognition",
          "description": "On 1 January 2018, a new accounting standard for revenue recognition (IFRS 15) became effective. It requires the recognition of fees for initial and ongoing listing services over time, whereas previously those fees were recognized at a point in time. Euronext applied the modified retrospective appro...",
          "riskLevel": "High",
          "auditResponse": "As IFRS 15 was adopted at the start of the year, we performed audit procedures on the opening balances to gain assurance on the transition from the previous standard. This included evaluating the acco..."
        },
        {
          "title": "Reliability and Continuity of the Information Technology and Systems and IT Transformation",
          "description": "A proper IT infrastructure ensures the reliability and continuity of Euronext’s business processes and financial reporting. Euronext continuously makes investments to further improve its IT environment and IT systems. As described in the other information under the section operational risk, Euronext...",
          "riskLevel": "High",
          "auditResponse": "We tested the IT general controls at Euronext related to logical access and change management and application controls embedded in the automated data processing systems, where we relied upon for finan..."
        }
      ],
      "2019": [
        {
          "title": "Accounting for the Acquisition of Oslo Børs VPS",
          "description": "In 2019, Euronext acquired all shares of Oslo Børs VPS for €693 million. The acquisition involved significant judgments in identifying intangible assets and allocating the purchase price, leading to the recognition of €252 million in intangible assets and €503 million in goodwill. The complexity and...",
          "riskLevel": "High",
          "auditResponse": "The audit team gained an understanding of the acquisition process, assessed the qualifications of external valuation experts, and tested the identification and valuation of tangible and intangible ass..."
        },
        {
          "title": "Measurement of Financial Assets at Fair Value Through Other Comprehensive Income",
          "description": "Euronext holds a minority interest in Euroclear S.A./N.V., classified as a financial asset at fair value through other comprehensive income. The fair value is estimated using an internally developed model based on a weighted approach involving return on equity, dividend growth rate, and cost of capi...",
          "riskLevel": "High",
          "auditResponse": "The audit team assessed the methodology and appropriateness of the valuation model, tested key inputs, and used their own valuation specialists to independently evaluate the valuation. The audit concl..."
        },
        {
          "title": "Reliability and Continuity of the IT Environment",
          "description": "Euronext's activities and financial reporting are highly dependent on the reliability and continuity of its IT environment. Effective general IT controls are crucial for ensuring the integrity and continuity of IT systems and the operating effectiveness of automated controls. The IT environment is c...",
          "riskLevel": "High",
          "auditResponse": "With the help of IT audit specialists, the audit team assessed the reliability and continuity of the IT environment, performed walkthrough procedures on IT processes, and tested the operating effectiv..."
        }
      ],
      "2020": [
        {
          "title": "Accounting for Acquired Businesses",
          "description": "During 2020, Euronext acquired all shares of VP Securities AS and a 60% interest in Nord Pool AS. The acquisitions have been included in the consolidated financial position and results of Euronext from the moment control was obtained. Accounting for business combinations involves a number of judgmen...",
          "riskLevel": "High",
          "auditResponse": "We gained an understanding of the material business acquisitions and made an assessment of the process that management has undertaken to determine the allocation of the purchase price. We tested the c..."
        },
        {
          "title": "Measurement of Financial Assets at Fair Value Through Other Comprehensive Income",
          "description": "Euronext holds a direct interest in Euroclear S.A. and an indirect minority interest in Euroclear S.A. through Sicovam Holding S.A. This investment is classified as a financial asset at fair value through other comprehensive income. Since 2018, a weighted approach is applied which is based on the re...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures comprised, among others, an evaluation of the methodology and the appropriateness of the valuation model for consistency and an assessment against generally accepted market practi..."
        },
        {
          "title": "Reliability, Availability and Continuity of the IT Environment",
          "description": "The activities and financial reporting of Euronext N.V. are highly dependent on the reliability and continuity of the IT environment. Effective general IT controls with respect to change management, logical access, infrastructure and operations, secure to a large extent the integrity and continuity ...",
          "riskLevel": "High",
          "auditResponse": "With the assistance of our IT audit specialists, we assessed the reliability, availability, and continuity of the IT environment to the extent necessary for the scope of our audit of the financial sta..."
        },
        {
          "title": "The Impact of the COVID-19 Pandemic",
          "description": "The developments around the COVID-19 pandemic have a profound impact on society and the economy, affecting the operational and financial performance of organizations and the assessment of the ability to continue as a going concern. The situation continues to evolve, giving rise to inherent uncertain...",
          "riskLevel": "High",
          "auditResponse": "We designed and performed specific audit procedures responsive to the potential impact. For internal controls testing, we inspected the monitoring conducted by the control functions of Euronext and, t..."
        }
      ],
      "2021": [
        {
          "title": "Accounting for Acquired Businesses",
          "description": "During 2021, Euronext N.V. acquired all shares of London Stock Exchange Group Holdings Italia S.p.A. (Borsa Italiana Group). Considerations paid amounted to EUR 4,447 million. The acquisition has been included in the consolidated financial position and results of Euronext N.V. from 29 April 2021, th...",
          "riskLevel": "High",
          "auditResponse": "We gained an understanding of the business acquisition and made an assessment of the process that management has undertaken to determine the allocation of the purchase price, including understanding t..."
        },
        {
          "title": "Measurement of Clearing Assets, Liabilities and Revenues",
          "description": "As part of the acquisitions in Italy, Euronext N.V. has become owner of the central counter party clearing activities of Cassa di Compensazione e Garanzia S.p.A. (CC&G), based in Rome. These activities result in short-term assets and liabilities of in total €137.7 billion at 31 December 2021, which ...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included, amongst others, evaluating the appropriateness of Euronext N.V.'s accounting policies regarding the clearing activities in accordance with IFRS 9 'Financial Instruments'..."
        },
        {
          "title": "Measurement of Financial Assets at Fair Value Through Other Comprehensive Income",
          "description": "Euronext N.V. holds a direct and an indirect minority interest in Euroclear S.A. This investment is classified as a financial asset at fair value through other comprehensive income. Since 2018, a weighted approach is applied which is based on the return on equity, expected dividend growth rate (non-...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures comprised, amongst others, evaluating the appropriateness of Euronext N.V.'s accounting policies related to the fair valuation of an interest in a non-listed company according to ..."
        },
        {
          "title": "Reliability and Continuity of the IT Environment",
          "description": "The activities and financial reporting of Euronext N.V. are highly dependent on the reliability and continuity of the IT environment. Effective general IT controls with respect to change management, logical access, infrastructure, and operations support the integrity and continuity of the IT systems...",
          "riskLevel": "High",
          "auditResponse": "IT audit specialists are an integral part of the engagement team and assess the reliability and continuity of the IT environment to the extent necessary for the scope of our audit of the financial sta..."
        }
      ],
      "2022": [
        {
          "title": "Impairment of Goodwill and Other Purchased Intangible Assets",
          "description": "Euronext accounts for a significant amount of goodwill and customer relationships on its consolidated balance sheet. As of 31 December 2022, goodwill amounts to €4 billion and other intangible assets have a value of €2.2 billion, mostly consisting of acquired customer relationships. Management is re...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included evaluating the appropriateness of Euronext’s accounting policies related to the impairment testing in accordance with IAS 36, 'Impairment of assets'. We obtained an under..."
        },
        {
          "title": "Measurement of Financial Assets at Fair Value Through Other Comprehensive Income",
          "description": "Euronext holds a direct and an indirect minority interest in Euroclear S.A. This investment is classified as a financial asset at fair value through other comprehensive income. As Euroclear is a non-listed company, Euronext developed an internal model to estimate the fair value, which is based on th...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included evaluating the appropriateness of Euronext’s accounting policies related to the fair valuation of an interest in a non-listed company according to IFRS 9, 'Financial Inst..."
        },
        {
          "title": "Recognition of Internally Developed Software",
          "description": "The capitalization of expenses for internally developed software involves judgement in assessing the capitalization against the recognition criteria set out in IAS 38, 'Intangible assets'. Euronext’s accounting policy for capitalizing software development costs is disclosed in section 3, under H). (...",
          "riskLevel": "High",
          "auditResponse": "We evaluated Euronext’s accounting policies related to the recognition of internally developed software in accordance with IAS 38, and whether assumptions and the criteria applied for capitalization a..."
        }
      ],
      "2023": [
        {
          "title": "Impairment of goodwill and other purchased intangible assets",
          "description": "Euronext accounts for a significant amount of goodwill and customer relationships on its consolidated balance sheet. As of 31 December 2023, goodwill amounts to €4 billion and other purchased intangible assets have a value of €2 billion, mostly consisting of acquired customer relations with a finite...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included evaluating the appropriateness of Euronext's accounting policies related to the impairment testing in accordance with IAS 36 'Impairment of assets'. We obtained an unders..."
        },
        {
          "title": "Measurement of financial assets at fair value through other comprehensive income",
          "description": "Euronext holds a direct and indirect minority interest in Euroclear S.A., which is classified as a financial asset at fair value through other comprehensive income. Euroclear is a non-listed company, and Euronext developed an internal model to estimate the fair value. In 2023, Euronext revalued its ...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included evaluating the appropriateness of Euronext's accounting policies related to the fair valuation of an interest in a non-listed company according to IFRS 9 'Financial Instr..."
        },
        {
          "title": "Recognition of internally developed software",
          "description": "The capitalization of expenses for internally developed software involves judgement in assessing the capitalization against the recognition criteria set out in IAS 38 'Intangible assets'. As of 31 December 2023, internally developed software capitalization amounts to €167 million. This includes inve...",
          "riskLevel": "High",
          "auditResponse": "We evaluated Euronext's accounting policies related to the recognition of internally developed software in accordance with IAS 38. We obtained an understanding of the recognition process, evaluated th..."
        },
        {
          "title": "Reliability and continuity of the IT environment",
          "description": "Euronext's activities and financial reporting are highly dependent on the reliability and continuity of the IT environment. Effective general IT controls support the integrity and continuity of electronic data processing and the operating effectiveness of automated controls. There is a risk that gen...",
          "riskLevel": "High",
          "auditResponse": "IT audit specialists assessed the reliability and continuity of the IT environment. We evaluated the design of IT processes, tested the operating effectiveness of general IT controls, and performed pr..."
        }
      ],
      "2024": [
        {
          "title": "Identity access management and change management",
          "description": "Euronext is highly dependent on its IT environment for the continuity of its operations. Inappropriate access or changes to an application or supporting infrastructure could compromise the continuity of Euronext's operations and the reliability of financial data....",
          "riskLevel": "High",
          "auditResponse": "Our audit approach relies to a large extent on automated controls. We tested the design, implementation, and, where appropriate, operating effectiveness of the general IT controls (GITC) and IT applic..."
        },
        {
          "title": "Measurement of Financial Assets at Fair Value Through Other Comprehensive Income",
          "description": "Euronext directly and indirectly owns Euroclear S.A., a non-listed company. Euronext uses an internal valuation model to estimate the fair value of this investment, which is recorded through other comprehensive income. The valuation model includes judgments and estimates such as the weighted approac...",
          "riskLevel": "High",
          "auditResponse": "The audit team performed substantive audit procedures, including assessing the reasonableness of input parameters in the model, involving a KPMG valuation specialist to evaluate the valuation methodol..."
        },
        {
          "title": "Risk of impairment of goodwill and other purchased intangible assets",
          "description": "Euronext recognised a significant amount of goodwill and customer relations. The amounts recognised, the assumptions and sensitivities used to assess the recoverable amount are disclosed in note 18 of the consolidated financial statements. A potential risk of impairment exists, to the extent future ...",
          "riskLevel": "High",
          "auditResponse": "The auditors inspected relevant documents to understand management's assessment of the potential impact of climate-related risks and opportunities on the company's annual report and financial statemen..."
        }
      ]
    }
  },
  "HKEX": {
    "name": "HKEX",
    "auditor": "PwC",
    "matters": {
      "2016": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2016, the Group has goodwill of $13,167 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively “LME Group”) in 2012. The goodwill was allocated to groups of Cash Generating Units (“CGUs”) within the “Commodities” operating segment ($10,310 m...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included testing management’s key controls on goodwill impairment assessment, assessing the methodology used to estimate the value in use of the respective groups of CGUs, evaluat..."
        },
        {
          "title": "Valuation, existence, accuracy and presentation of certain financial assets and liabilities",
          "description": "The majority of the Group’s financial assets and financial liabilities are classified as level 2. As at 31 December 2016, the Group’s financial assets and liabilities classified as level 2 include debt securities ($301 million), collective investment schemes ($2,886 million), and base metals derivat...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included focusing on the valuation and existence of debt securities and collective investment schemes due to the size of these balances and the judgement involved in selecting the..."
        }
      ],
      "2017": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2017, the Group has goodwill of HK$13,277 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively “LME Group”) in 2012. Goodwill was allocated to groups of Cash Generating Units (CGUs) within the “Commodities” segment, HK$10,396 million, and ...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included testing management’s controls over the goodwill impairment assessment, assessing the discounted cash flow model used by management, evaluating the reasonableness of manag..."
        },
        {
          "title": "IT systems and controls over financial accounting and reporting",
          "description": "The Group operates securities and derivatives trading, clearing and settlement systems, which process significant volumes of daily transactions and market data. The trading, clearing and settlement fees generated from the transactions processed are the key drivers of the Group’s revenue. The revenue...",
          "riskLevel": "High",
          "auditResponse": "1. Assessed the IT control environment, examined the IT governance framework and tested the IT general controls of the key IT systems that support the revenue recognition and financial reporting proce..."
        }
      ],
      "2018": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As of 31 December 2018, the Group has goodwill of HK$13,298 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively “LME Group”) in 2012. Goodwill was allocated to groups of Cash Generating Units (“CGUs”) within the “Commodities” segment, HK$10,412 million, an...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included assessing the discounted cash flow model used by management to estimate the value-in-use of the respective groups of CGUs, assessing the reasonableness of the WACCs used ..."
        },
        {
          "title": "IT systems and controls over financial accounting and reporting",
          "description": "The Group operates securities and derivatives trading, clearing and settlement systems, which process significant volumes of daily transactions and market data. The trading, clearing and settlement fees generated from the transactions processed are the key drivers of the Group’s revenue. The revenue...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures over the relevant IT systems and related controls included assessing the IT control environment, examining the IT governance framework, testing the IT general controls of the key ..."
        }
      ],
      "2019": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2019, the Group has goodwill of HK$13,233 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively “LME Group”) in 2012. Goodwill was allocated to groups of Cash Generating Units (“CGUs”) within the “Commodities” segment, HK$10,361 million, an...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included testing management’s key controls over the goodwill impairment assessment, assessing the discounted cash flow model used by management, evaluating the reasonableness of m..."
        },
        {
          "title": "IT systems and controls over financial accounting and reporting",
          "description": "The Group operates securities and derivatives trading, clearing, and settlement systems, which process significant volumes of daily transactions and market data. The trading, clearing, and settlement fees generated from the transactions processed are the key drivers of the Group’s revenue. The reven...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures over the relevant IT systems and related controls included assessing the IT control environment, examining the IT governance framework, testing IT general controls, testing identi..."
        }
      ],
      "2020": [
        {
          "title": "Goodwill Impairment Assessment",
          "description": "As at 31 December 2020, the Group has goodwill of HK$13,168 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively “LME Group”) in 2012. Goodwill was allocated to groups of Cash Generating Units (“CGUs”) within the “Commodities” segment, HK$10,310 million, an...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included: 1) Assessing the discounted cash flow model used by management to estimate the value-in-use of the respective groups of CGUs within the Commodities and Post Trade segmen..."
        },
        {
          "title": "IT Systems and Controls over Financial Accounting and Reporting",
          "description": "The Group operates securities and derivatives trading, clearing and settlement systems, which process significant volumes of daily transactions and market data. The trading, clearing and settlement fees generated from the transactions processed are the key drivers of the Group’s revenue. The revenue...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included: 1) Assessing the IT control environment, examining the IT governance framework, and testing the IT general controls of the key IT systems that support the revenue recogn..."
        }
      ],
      "2021": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2021, the Group has goodwill of HK$13,241 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively “LME Group”) in 2012. Goodwill was allocated to groups of Cash Generating Units (“CGUs”) within the “Commodities” segment, HK$10,368 million, an...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included: 1) Assessing the discounted cash flow model used by management to estimate the value-in-use of the respective groups of CGUs within the Commodities and Post Trade segmen..."
        },
        {
          "title": "IT systems and controls over financial accounting and reporting",
          "description": "The Group operates securities and derivatives trading, clearing and settlement systems, which process significant volumes of daily transactions and market data. The trading, clearing and settlement fees generated from the transactions processed are the key drivers of the Group’s revenue. The revenue...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included: 1) Assessing the IT control environment, examining the IT governance framework, and testing the IT general controls of the key IT systems that support the revenue recogn..."
        }
      ],
      "2022": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2022, the Group has goodwill of HK$13,367 million arising from various acquisitions. Goodwill of HK$13,256 million arising from the acquisition of LME Holdings Limited and its subsidiaries (collectively the “LME Group”) in 2012 was allocated to Cash Generating Units (“CGUs”) for th...",
          "riskLevel": "High",
          "auditResponse": "Our procedures to evaluate the Group’s goodwill impairment assessments included: 1) Understanding of the Group’s internal controls and management’s process for goodwill impairment assessment and asses..."
        },
        {
          "title": "IT systems and controls over revenue and financial accounting and reporting processes",
          "description": "The Group operates securities and derivatives trading, clearing and settlement systems, which process significant volumes of transactions and market data. Trading, clearing and settlement fee revenue generated from these transactions comprise the majority of the Group’s revenue of HK$16,934 million....",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures over the key systems and related controls included: 1) Assessing the control environment, including the management over the data capture and processing of reporting fee revenue. 2..."
        }
      ],
      "2023": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2023, the Group has goodwill of HK$13,371 million arising from various acquisitions. Goodwill of HK$13,262 million arises from the acquisition of LME Holdings Limited and its subsidiaries (collectively referred to as the 'LME Group'). This goodwill is attributable to the Cash Gener...",
          "riskLevel": "High",
          "auditResponse": "Our procedures to evaluate the Group’s goodwill impairment assessment included: 1) Understanding management’s process for performing the goodwill impairment assessment and assessing the inherent risk ..."
        },
        {
          "title": "Control environment supporting key information technology systems",
          "description": "The Group operates securities and derivatives trading, which involves significant end-to-end processes of key systems that capture volumes of transactions and market data. These systems generate fee revenue and clearing and settlement fees, which account for the majority of the Group’s revenue. The ...",
          "riskLevel": "High",
          "auditResponse": "We assessed the control environment, including the IT governance framework and IT general controls over the key systems. We tested the design and operating effectiveness of automated application contr..."
        }
      ],
      "2024": [
        {
          "title": "Goodwill impairment assessment",
          "description": "As at 31 December 2024, the Group has goodwill of HK$13,297 million arising from various acquisitions. Goodwill of HK$13,192 million arises from the acquisition of LME Holdings Limited and its subsidiaries (collectively referred to as the 'LME Group'). This goodwill is attributable to the Cash Gener...",
          "riskLevel": "High",
          "auditResponse": "Our procedures to evaluate the Group’s goodwill impairment assessment included: 1) Understanding management’s process for performing the goodwill impairment assessment and assessing the inherent risk ..."
        },
        {
          "title": "Control environment supporting key information technology systems",
          "description": "The Group operates securities and derivatives trading, which involves significant end-to-end processes of key systems that capture volumes of transactions and market data. These systems generate fee revenue and clearing and settlement fees, which account for the majority of the Group’s revenue. The ...",
          "riskLevel": "High",
          "auditResponse": "We assessed the control environment, including the IT governance framework, cybersecurity, and IT incident management. We tested the design and operating effectiveness of automated application control..."
        }
      ]
    }
  },
  "ICE": {
    "name": "ICE",
    "auditor": "Ernst & Young",
    "matters": {
      "2019": [
        {
          "title": "Accounting for Acquisition",
          "description": "During 2019, the Company completed its acquisition of Simplifile, LC (“Simplifile”) for net consideration of $338 million. This transaction was accounted for as a business combination. Auditing the Company's accounting for its acquisition of Simplifile was complex due to the significant estimation i...",
          "riskLevel": "High",
          "auditResponse": "We tested the Company's controls over its accounting for acquisitions, including controls over the estimation process supporting the recognition and measurement of the customer relationship intangible..."
        },
        {
          "title": "Accounting for Income Taxes",
          "description": "The Company operates in the United States and multiple international tax jurisdictions and is subject to tax treaty arrangements and transfer pricing guidelines for intercompany transactions. For the year-ended December 31, 2019, the Company recognized consolidated income tax expense of $521 million...",
          "riskLevel": "High",
          "auditResponse": "We tested the Company’s controls that address the risks of material misstatement relating to the Company’s consolidated income tax expense. We performed audit procedures that included recalculating co..."
        }
      ],
      "2020": [
        {
          "title": "Accounting for Acquisition of Ellie Mae",
          "description": "During 2020, the Company completed its acquisition of Ellie Mae, Inc. (Ellie Mae) for aggregate consideration of $11.4 billion. This transaction was accounted for as a business combination. Auditing the Company's accounting for its acquisition of Ellie Mae was complex due to the significant estimati...",
          "riskLevel": "High",
          "auditResponse": "We tested the Company's controls that address the risk of material misstatement relating to the Company's accounting for the acquisition. We tested controls over the estimation process supporting the ..."
        },
        {
          "title": "Accounting for Income Taxes",
          "description": "The Company operates in the United States and multiple international tax jurisdictions and is therefore subject to various tax treaty arrangements and where applicable, transfer pricing guidelines for intercompany transactions. For the year-ended December 31, 2020, the Company recognized consolidate...",
          "riskLevel": "High",
          "auditResponse": "We tested the Company’s controls that address the risks of material misstatement relating to the Company’s consolidated income tax expense. We tested controls over management’s calculation of the fede..."
        }
      ],
      "2021": [
        {
          "title": "Accounting for Income Taxes",
          "description": "As discussed in Note 13 to the consolidated financial statements, the Company operates in the United States and multiple international tax jurisdictions and is therefore subject to various tax treaty arrangements and, where applicable, transfer pricing guidelines for intercompany transactions. Conso...",
          "riskLevel": "High",
          "auditResponse": "We tested the Company’s controls that address the risks of material misstatement relating to the Company’s consolidated income tax expense. For example, we tested controls over management’s calculatio..."
        }
      ],
      "2022": [
        {
          "title": "Accounting for Income Taxes",
          "description": "As discussed in Note 13 to the consolidated financial statements, the Company operates in the United States and multiple international tax jurisdictions and is therefore subject to various tax treaty arrangements and, where applicable, transfer pricing guidelines for intercompany transactions. Conso...",
          "riskLevel": "High",
          "auditResponse": "We tested the Company’s controls that address the risks of material misstatement relating to the Company’s consolidated income tax expense. For example, we tested controls over management’s calculatio..."
        }
      ],
      "2023": [
        {
          "title": "Accounting for Business Combinations",
          "description": "During 2023, the Company completed its acquisition of Black Knight, Inc. (Black Knight) for aggregate consideration of $11.8 billion. This transaction was accounted for as a business combination. Auditing the Company's accounting for its acquisition of Black Knight was complex due to the significant...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding, evaluated the design and tested the operating effectiveness of the Company's controls that address the risk of material misstatement relating to the Company's accounting ..."
        },
        {
          "title": "Accounting for Income Taxes",
          "description": "The Company operates globally and files income tax returns in the U.S. and in various state, local and foreign jurisdictions. Uncertainty in a tax position may arise because tax laws and rulings are subject to interpretation in each jurisdiction. The Company uses significant judgment to determine wh...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding, evaluated the design and tested the operating effectiveness of the controls related to management's accounting for uncertain tax positions. We tested controls relating to..."
        }
      ],
      "2024": [
        {
          "title": "Accounting for Income Taxes",
          "description": "The Company operates globally and files income tax returns in the U.S. and in various state, local, and foreign jurisdictions. Uncertainty in a tax position may arise because tax laws and rulings are subject to interpretation in each jurisdiction. The Company uses significant judgment to determine w...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding, evaluated the design and tested the operating effectiveness of the controls related to management's accounting for uncertain tax positions. We tested controls relating to..."
        }
      ]
    }
  },
  "LSEG": {
    "name": "LSEG",
    "auditor": "Ernst & Young",
    "matters": {
      "2015": [
        {
          "title": "Goodwill and Purchased Intangible Assets Impairment",
          "description": "The Group holds significant intangible assets, including goodwill, customer relationships, brands, software licenses, and intellectual property. The balance of goodwill was £3.5 billion, compared to £4.3 billion in the prior period. Management performs an annual impairment assessment for goodwill an...",
          "riskLevel": "High",
          "auditResponse": "We examined the cash flow forecasts supporting management’s goodwill impairment assessment and tested compliance with IAS 36 'Impairment of Assets'. We assessed the reasonableness of forecasts and und..."
        },
        {
          "title": "Risk of fraud in recognition of revenue",
          "description": "The risk of fraud in the recognition of revenue, particularly in secondary capital markets trading, new or updated post-trade clearing arrangements, and information services audit revenue accruals....",
          "riskLevel": "High",
          "auditResponse": "The audit team focused on areas such as secondary capital markets trading, new or updated post-trade clearing arrangements, and information services audit revenue accruals. They evaluated the controls..."
        }
      ],
      "2016": [
        {
          "title": "Divestment of Russell Investment Management Business",
          "description": "The divestment of the Russell Investment Management (Russell IM) business, which occurred in H1 2016, poses a risk that the divestment was accounted for or disclosed inappropriately. The loss on discontinued operations was £69.6 million, compared to a £47.7 million profit in the prior year. The dive...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the divestment process and assessed the design and effectiveness of key controls. We evaluated management’s assessment of the closing date for accounting purposes and..."
        },
        {
          "title": "Implementation of Oracle Finance System",
          "description": "The implementation of a new Oracle finance system poses a risk that exceptions in IT general controls could lead to errors in data integrity, accounting, or financial reporting. This is a new risk this year....",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the implementation of the Oracle finance system and assessed the following areas of the migration project: governance, data conversion, migration procedures, system i..."
        },
        {
          "title": "Risk of fraud in recognition of revenue in secondary capital markets trading, fees or revenue shares for clearing arrangements, and information services revenue accruals",
          "description": "The risk of fraud in revenue recognition exists due to the complexity of revenue structures and the potential for management to manipulate results. This includes secondary capital markets trading, fee or revenue sharing in clearing arrangements, and information services revenue accruals....",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the processes and performed testing of the operating effectiveness of key controls. We performed analytical procedures, journal entry testing, and cut-off testing. We..."
        },
        {
          "title": "Risk that goodwill and purchased intangible assets may be impaired",
          "description": "The Group holds significant intangible assets on its balance sheet, including goodwill, customer relationships, brands, software licenses, and intellectual property. The risk of impairment is assessed annually, and the impairment assessment involves significant management judgment in the application...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the impairment assessment process and assessed the reasonableness of cash flow forecasts and underlying assumptions. We tested the WACC discount rates and LTGRs, and ..."
        }
      ],
      "2017": [
        {
          "title": "Risk of fraud in recognition of revenue in secondary capital markets trading, revenue share for clearing arrangements, and information services revenue accruals",
          "description": "The risk of fraud in revenue recognition is heightened due to multiple pricing structures based on product types, customer activity, and volumes. Revenue sharing in clearing arrangements and information services revenue accruals can require estimation based on prior billings or preliminary usage. Co...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the secondary capital markets trading, revenue share clearing arrangements, and information services revenue accruals processes. We tested the operating effectiveness..."
        },
        {
          "title": "Risk that goodwill and purchased intangible assets may be impaired",
          "description": "The Group holds significant intangible assets on its balance sheet, including goodwill, customer relationships, brands, software licenses, and intellectual property. The balance of goodwill and purchased intangible assets was £4.2 billion, compared to £3.9 billion in the prior year. For 7 material c...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the impairment assessment process and evaluated the design effectiveness of key controls. We tested compliance with the requirements of IAS 36 'Impairment of Assets'...."
        },
        {
          "title": "Risk that the acquisition of businesses was accounted for incorrectly",
          "description": "The Group undertook 2 significant acquisitions in the current year: Mergent Inc. and The Yield Book and Citi Fixed Income Indices. The risk involves the appropriate accounting for these acquisitions, including the significant judgement involved in the determination of goodwill and purchased intangib...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the business acquisition process and assessed the design effectiveness of key controls. We inspected the final signed sale and purchase agreements and agreed the purc..."
        },
        {
          "title": "Risk that the implementation of the Oracle finance system could lead to errors in data integrity, accounting or financial reporting",
          "description": "The general ledger for LCH Group (excluding LCH S.A.) and LSEG US Holdco Inc. was migrated to Oracle in January 2017 and May 2017, respectively. The risk involves potential errors in data integrity, accounting, or financial reporting due to the implementation of the new system....",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the implementation of the Oracle finance system, including the relevant processes pre and post Oracle implementation. We assessed various areas of the migration proje..."
        }
      ],
      "2018": [
        {
          "title": "Application of IFRS 15 to primary capital markets admission fees",
          "description": "The Group implemented IFRS 15 'Revenue from contracts with customers' on 1 January 2018, which required a change in the accounting policy for revenue recognition related to primary capital markets admission fees. This change involved recognizing revenue over the listing period rather than on the dat...",
          "riskLevel": "High",
          "auditResponse": "We assessed the revised accounting policy for compliance with IFRS 15 and the IFRIC decision. We tested the model used to calculate the period over which revenue is deferred and subsequently amortized..."
        },
        {
          "title": "Risk of fraud in recognition of revenue in secondary capital markets trading, revenue share for clearing arrangements, and information services revenue accruals",
          "description": "There is a risk of fraud in the recognition of revenue from secondary capital markets trading, revenue share for clearing arrangements, and information services revenue accruals. This involves significant judgment by management in determining the timing and amount of revenue recognition....",
          "riskLevel": "High",
          "auditResponse": "We performed detailed testing of revenue transactions, including reviewing supporting documentation and performing cut-off tests. We assessed the appropriateness of revenue recognition policies and th..."
        },
        {
          "title": "Risk that expenses related to internally developed software are capitalised inappropriately, or that internally developed software is impaired",
          "description": "There is a risk that expenses related to internally developed software are capitalized inappropriately, or that internally developed software is impaired. This involves significant judgment by management in determining the capitalization and impairment of such software....",
          "riskLevel": "High",
          "auditResponse": "We reviewed the policies and procedures for capitalizing and impairing internally developed software, and tested the application of these policies. We assessed the reasonableness of the assumptions us..."
        },
        {
          "title": "Risk that goodwill and purchased intangible assets may be impaired",
          "description": "The Group holds significant intangible assets on its balance sheet, including goodwill, customer relationships, brands, software licenses, and intellectual property. The risk of impairment of these assets is significant due to the size of the balances and the involvement of significant judgment by m...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the impairment assessment process and assessed the design effectiveness of key controls. For material cash generating units (CGUs), we examined the cash flow forecast..."
        }
      ],
      "2019": [
        {
          "title": "Risk of expenses related to internally developed software being capitalised inappropriately, or that internally developed software is impaired",
          "description": "The capitalisation of expenses to internally developed software involves management’s judgement, when making their assessment of capitalisation against criteria set out in IFRS as adopted by the EU. The Group is required to review capitalised software assets for impairment whenever events or changes...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the capitalisation and impairment assessment processes and assessed the design and operating effectiveness of key controls. We concluded that the controls were design..."
        },
        {
          "title": "Risk of fraud in recognition of revenue in secondary capital markets trading, revenue share for clearing arrangements, and information services revenue",
          "description": "The risk of fraud in recognition of revenue in secondary capital markets trading, revenue share for clearing arrangements, and information services revenue accruals within the FTSE Russell business. This includes the complexity of revenue recognition for secondary capital markets revenue, which invo...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the secondary capital markets trading, revenue share clearing arrangements, and FTSE Russell revenue accruals processes, and evaluated the design effectiveness of key..."
        },
        {
          "title": "Risk that goodwill and purchased intangible assets may be impaired",
          "description": "The Group holds significant intangible assets on its balance sheet, including goodwill, customer relationships, brands, software licenses, and intellectual property. The valuation of these intangible assets is a key audit matter due to the size of the goodwill and purchased intangible assets as at 3...",
          "riskLevel": "High",
          "auditResponse": "We performed the following procedures: \\n- Examined the cash flow forecasts which support management’s impairment assessment and tested compliance with the requirements of IAS 36 'Impairment of Assets..."
        }
      ],
      "2020": [
        {
          "title": "Risk of fraud in recognition of revenue in secondary capital markets trading and Information Services revenue accruals within the FTSE Russell business",
          "description": "There is a risk of fraud in the recognition of revenue in secondary capital markets trading and Information Services revenue accruals within the FTSE Russell business, which could result in material misstatements....",
          "riskLevel": "High",
          "auditResponse": "We performed detailed testing of revenue recognition processes, including reviewing supporting documentation, performing cut-off tests, and interviewing key personnel. We also used data analytics to i..."
        },
        {
          "title": "Risk that expenses related to internally developed software are capitalised inappropriately, or that internally developed software is impaired",
          "description": "There is a risk that expenses related to internally developed software are capitalized inappropriately, or that internally developed software is impaired, leading to potential misstatements in the financial statements....",
          "riskLevel": "High",
          "auditResponse": "We reviewed the policies and procedures for capitalizing and impairing internally developed software, tested the application of these policies, and performed substantive testing on the capitalization ..."
        },
        {
          "title": "Risk that the impairment of goodwill and purchased intangible assets is inaccurate or incomplete",
          "description": "There is a risk that the impairment of goodwill and purchased intangible assets is inaccurate or incomplete, which could lead to material misstatements in the financial statements....",
          "riskLevel": "High",
          "auditResponse": "We performed detailed reviews of the impairment models, including the assumptions and inputs used, and compared these to historical performance and market data. We also involved specialists to validat..."
        }
      ],
      "2021": [
        {
          "title": "Risk of fraud in the recognition of revenue in secondary capital markets trading fees, FTSE Russell revenue accruals, and Refinitiv subscription revenue",
          "description": "There is a risk of fraud in the recognition of revenue in secondary capital markets trading fees, FTSE Russell revenue accruals, and Refinitiv subscription revenue within the Data & Analytics business. Compensation tied to performance may create an incentive for management to manipulate results....",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the processes and controls relevant to revenue recognition, evaluated the design effectiveness of key controls, and performed cut-off testing. We adopted a substantiv..."
        },
        {
          "title": "Risk that expenses related to internally developed software are capitalised inappropriately, or that internally developed software is impaired",
          "description": "There is a risk that expenses related to internally developed software may be capitalized inappropriately or that the software may be impaired, leading to potential misstatement of the financial statements....",
          "riskLevel": "High",
          "auditResponse": "We assessed the capitalization policies and controls, reviewed the documentation supporting the capitalization decisions, and performed impairment testing to ensure the accuracy of the reported amount..."
        },
        {
          "title": "Risk that the disposal of the Borsa Italiana Group is accounted for or disclosed incorrectly",
          "description": "There is a risk of error in the appropriate accounting for the significant transaction involving a gain on disposal of Borsa Italiana Group and the relevant presentation and disclosure as a discontinued operation....",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the process relating to the Borsa Italiana Group disposal, inspected and reviewed the documents pertaining to the completion of the sale transaction, and performed au..."
        },
        {
          "title": "Risk that the impairment of goodwill and purchased intangible assets is inaccurate or incomplete",
          "description": "There is a risk that the carrying values of goodwill and purchased intangible assets are inaccurate or incomplete, and the related disclosures are not compliant with IAS 36 'Impairment of Assets' and IAS 38 'Intangible Assets'....",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the impairment assessment process, assessed the design effectiveness of key controls, and adopted a substantive audit approach. We examined cash flow forecasts, teste..."
        },
        {
          "title": "Risk that the Refinitiv acquisition is accounted for and disclosed incorrectly",
          "description": "There is a significant risk of inappropriate accounting for the acquisition in accordance with IFRS 3 'Business Combinations', including alignment to LSEG accounting policies, and the related disclosures due to significant judgments required in the determination of the fair value of consideration tr...",
          "riskLevel": "High",
          "auditResponse": "We confirmed our understanding of the business combination accounting process, held discussions with management, and reviewed management’s assessment of Refinitiv’s accounting policies. We verified th..."
        }
      ],
      "2022": [
        {
          "title": "Accounting for acquisitions",
          "description": "During 2022, the Group completed the acquisitions of Global Data Consortium, Inc. (GDC), MayStreet, Inc. (MayStreet), TORA Holdings, Inc. (TORA) and Quantile Group Limited (Quantile). There is a complexity in auditing the accounting for these acquisitions as there are significant judgements and assu...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: We confirmed our understanding of the business combinations accounting process including process and controls relevant to the acquisitions. Technical accounting: We reviewed manage..."
        },
        {
          "title": "Capitalisation and impairment of internally developed software",
          "description": "The Group reported capitalised internally developed software of £2,653 million (2021: £2,318 million) and an impairment charge of £11 million (2021: £13 million). Auditing the capitalisation of expenses to internally developed software is complex as it involves management judgement when making the a...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: We confirmed our understanding of both the capitalisation and impairment assessment processes and assessed the design and operating effectiveness of key controls. Additions testing..."
        },
        {
          "title": "Impairment of goodwill and purchased intangible assets",
          "description": "The Group reported goodwill of £19,829 million (2021: £17,486 million) and net purchased intangible assets of £12,584 million (2021: £11,920 million). The complexity in auditing goodwill and purchased intangible assets relates to the use of judgement in the impairment assessment. Both goodwill and p...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: We confirmed our understanding of the impairment assessment process and assessed the design effectiveness of key controls. Carrying value of goodwill: For material cash generating ..."
        },
        {
          "title": "Revenue recognition",
          "description": "The Group reported £7,454 million of revenue from external customers, which consisted of £5,259 million in Data & Analytics, £1,459 million in Post Trade, and £736 million in Capital Markets. Auditing revenue recorded is complex due to the complexity of the IT systems used in the initiation, process...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: We confirmed our understanding of the processes and controls relevant to the material revenue streams of the Group. We also evaluated the design effectiveness and tested operating ..."
        }
      ],
      "2023": [
        {
          "title": "Accounting for acquisitions",
          "description": "During 2023, the Group completed the acquisition of AcadiaSoft, Inc., with net assets acquired of £229 million and goodwill recognised of £341 million. The risk has reduced this year given the lower volume of businesses acquired and value of the acquisition compared to the prior year....",
          "riskLevel": "High",
          "auditResponse": "Control assessment: Confirmed understanding of business combinations accounting process and discussed governance structures with management. Technical accounting: Reviewed management’s business combin..."
        },
        {
          "title": "Capitalisation and subsequent impairment of internally developed software",
          "description": "The Group reported capitalised internally developed software of £2,717 million (2022: £2,653 million) and an impairment charge of £10 million (2022: £11 million). The complexity in auditing the capitalisation of software costs involves management judgement in determining whether costs can be capital...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: Confirmed understanding of capitalisation and impairment assessment processes and assessed design and operating effectiveness of key controls. Additions testing: Agreed amounts cap..."
        },
        {
          "title": "Measurement of acquired intangible assets, including goodwill",
          "description": "The Group reported goodwill of £19,246 million (2022: £19,829 million) and net purchased intangible assets of £11,158 million (2022: £12,584 million). The complexity in auditing goodwill and purchased intangible assets relates to the use of judgement in impairment assessments and re-evaluating amort...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: Confirmed understanding of impairment assessment process and assessed design effectiveness of key controls. Carrying value of goodwill: Examined cash flow forecasts, tested complia..."
        },
        {
          "title": "Revenue recognition",
          "description": "The Group reported £8,061 million (2022: £7,454 million) of revenue from external customers, which consisted of £5,637 million (2022: £5,259 million) in Data & Analytics, £1,546 million (2022: £1,459 million) in Capital Markets and £878 million (2022: £736 million) in Post Trade. The complexity in a...",
          "riskLevel": "High",
          "auditResponse": "Control assessment: Confirmed understanding of processes and controls relevant to material revenue streams. Evaluated design effectiveness and tested operating effectiveness of key controls. Overall p..."
        }
      ],
      "2024": [
        {
          "title": "Capitalisation and subsequent impairment assessment of internally-developed intangible assets",
          "description": "The Group reported £2,517 million of internally-developed intangible assets, net of amortisation and impairment, at 31 December 2024 (31 December 2023: £2,717 million), as outlined in note 9. The capitalisation of certain expenditure on internally-developed assets is subjective and management judgem...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures in respect of capitalisation and impairment of these assets, to address the risk of errors and fraud, included the following:— Obtained an understanding of relevant controls over ..."
        },
        {
          "title": "Revenue recognition",
          "description": "The Group recognised revenue from external customers of £8,579 million for the year ended 31 December 2024 (31 December 2023: £8,061 million). Of this, £918 million relates to FTSE Russell (31 December 2023: £844 million) and £4,374 million relates to Data & Analytics (31 December 2023: £4,301 milli...",
          "riskLevel": "High",
          "auditResponse": "We performed the following procedures over revenue:— We obtained an understanding of relevant controls over the Group’s material revenue streams. However, as a result of the IT control deficiencies se..."
        },
        {
          "title": "Valuation of intangible assets arising from business combinations, including goodwill",
          "description": "At 31 December 2024, and as outlined in note 9, the Group reported £19,668 million of goodwill (31 December 2023: £19,246 million) and £10,785 million of assets arising from business combinations, such as customer relationships, brands and databases and content (purchased intangible assets) (31 Dece...",
          "riskLevel": "High",
          "auditResponse": "We performed the following procedures over the goodwill impairment test:— Obtained an understanding of relevant controls over the identification of impairment indicators for goodwill and purchased int..."
        }
      ]
    }
  },
  "Nasdaq Inc.": {
    "name": "Nasdaq Inc.",
    "auditor": "Ernst & Young",
    "matters": {
      "2019": [
        {
          "title": "Market Technology Revenue Recognition",
          "description": "As described in Notes 3 and 9 to the consolidated financial statements, the Company enters into long-term market technology contracts with customers to develop customized technology solutions, license the right to use software, and provide support and other services which results in these contracts ...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's processes with respect to estimates that impact the timing and measurement of r..."
        }
      ],
      "2020": [
        {
          "title": "Market Technology Revenue Recognition",
          "description": "The Company enters into long-term market technology contracts with customers to develop customized technology solutions, license the right to use software, and provide support and other services. These contracts contain multiple performance obligations. The Company recorded market technology deferre...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's processes with respect to estimates that impact the timing and measurement of r..."
        }
      ],
      "2021": [
        {
          "title": "Acquisition of Verafin",
          "description": "The company completed the acquisition of Verafin for an aggregate purchase price of $2.75 billion, resulting in $1.88 billion of goodwill and $815 million of intangible assets, including customer relationships and developed technology....",
          "riskLevel": "High",
          "auditResponse": "We tested controls over the estimation process supporting the recognition and measurement of goodwill and intangible assets. We evaluated the company's use of valuation methodologies, significant assu..."
        },
        {
          "title": "Market Technology Revenue Recognition",
          "description": "The Company enters into long-term contracts with customers to develop customized technology solutions, license the right to use software, and provide support and other services which results in the allocation of contract transaction price to performance obligations, including management’s review of ...",
          "riskLevel": "High",
          "auditResponse": "We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's processes with respect to estimates that impact the timing and measurement of r..."
        }
      ],
      "2022": [
        {
          "title": "Market Technology Revenue Recognition",
          "description": "The audit focused on the Company's processes regarding estimates that impact the timing and measurement of revenue recognition, particularly for market technology contracts. These contracts involve providing customized technology solutions, licensing software, and offering support and other services...",
          "riskLevel": "High",
          "auditResponse": "The auditors tested controls over the allocation of contract transaction price to performance obligations, evaluated the design and operating effectiveness of controls, and performed substantive audit..."
        }
      ],
      "2023": [
        {
          "title": "Acquisition of Adenza",
          "description": "During 2023, the Company completed its acquisition of Adenza, which was accounted for as a business combination for a total purchase consideration of $5,750 million in cash (subject to customary post-closing adjustments) and the issuance of 85,608,414 shares of Nasdaq common stock at a price of $48....",
          "riskLevel": "High",
          "auditResponse": "The audit team obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the Company’s processes with respect to estimates that impact the accounting for..."
        }
      ],
      "2024": [
        {
          "title": "Calypso and AxiomSL on-premises license revenue recognition",
          "description": "As described in Note 2 to the consolidated financial statements, the Company recognizes revenue from Calypso and AxiomSL on-premises licenses, which involves significant judgment due to the complexity of the arrangements and the timing of revenue recognition. The critical audit matter involved evalu...",
          "riskLevel": "High",
          "auditResponse": "Our audit procedures included, among others, testing the design and operating effectiveness of controls over revenue recognition, including controls over the determination of the transaction price and..."
        }
      ]
    }
  },
  "TMX Group": {
    "name": "TMX Group",
    "auditor": "KPMG",
    "matters": {
      "2020": [
        {
          "title": "Evaluation of the impairment analysis for goodwill and indefinite life intangible assets",
          "description": "The Entity has recorded goodwill and indefinite life intangible assets of $1,653.7 million and $2,323.1 million respectively as of December 31, 2020. The Entity performs impairment testing for goodwill and indefinite life intangible assets on an annual basis or more frequently when there is an indic...",
          "riskLevel": "High",
          "auditResponse": "We evaluated the appropriateness of future cash flows by comparing the Entity’s prior year expected future cash flows to the actual results to assess the Entity’s budgeting process and assessing futur..."
        }
      ],
      "2021": [
        {
          "title": "Evaluation of the impairment analysis for goodwill and indefinite life intangible assets",
          "description": "The Entity has recorded goodwill and indefinite life intangible assets of $1,695.8 million and $2,322.4 million respectively as of December 31, 2021. The Entity performs impairment testing for goodwill and indefinite life intangible assets on an annual basis or more frequently when there is an indic...",
          "riskLevel": "High",
          "auditResponse": "The primary procedures we performed to address this key audit matter included the following:   We evaluated the appropriateness of the future revenues of the acquired business, future revenues attribu..."
        },
        {
          "title": "Measurement of the BOX Purchase Consideration and Customer Relationships Acquired in the AST Canada and BOX Business Combinations",
          "description": "The Entity completed the AST Canada acquisition on August 12, 2021, and the BOX acquisition on January 3, 2022. The provisional amounts estimated for the customer relationships acquired in these business combinations are $79.0 million and $305.9 million, respectively. The fair value of these custome...",
          "riskLevel": "High",
          "auditResponse": "The audit team evaluated the appropriateness of the future revenues, customer attrition rates, and discount rates by considering past performance and involving valuation professionals with specialized..."
        }
      ],
      "2022": [
        {
          "title": "Evaluation of the impairment analysis for goodwill and indefinite life intangible assets",
          "description": "The Entity has recorded goodwill and indefinite life intangible assets of $1,768.7 million and $2,328.5 million respectively as of December 31, 2022. The Entity performs impairment testing for goodwill and indefinite life intangible assets at least annually even when there is no indication of impair...",
          "riskLevel": "High",
          "auditResponse": "The primary procedures we performed to address this key audit matter included evaluating the significant assumptions used by the Entity in its impairment testing, assessing the appropriateness of the ..."
        },
        {
          "title": "Measurement of the BOX purchase consideration and the customer relationships acquired in the BOX business combination",
          "description": "The Entity obtained control of BOX Holdings Group LLC (BOX) on January 3, 2022, and accounted for it as a business combination. The Entity remeasured its previously held ownership interest at $207.6 million, which comprises the purchase consideration. The identified acquired intangible assets includ...",
          "riskLevel": "High",
          "auditResponse": "The primary procedures performed included evaluating the appropriateness of future revenues, customer attrition rates, and discount rates by considering past performance and involving valuation profes..."
        }
      ],
      "2023": [
        {
          "title": "Evaluation of the impairment analysis for goodwill and indefinite life intangible assets",
          "description": "The Entity has recorded goodwill and indefinite life intangible assets of $1,776.8 million and $2,329.4 million respectively as of December 31, 2023. The Entity performs impairment testing for goodwill and indefinite life intangible assets at least annually even when there is no indication of impair...",
          "riskLevel": "High",
          "auditResponse": "The primary procedures we performed to address this key audit matter included the following: \\n- Evaluating the appropriateness of future cash flows by comparing the Entity’s prior year expected futur..."
        }
      ],
      "2024": [
        {
          "title": "Evaluation of the impairment analysis for goodwill and indefinite life intangible assets",
          "description": "The Entity has recorded goodwill and indefinite life intangible assets of $2,637.7 million and $2,425.4 million respectively as of December 31, 2024. The Entity performs impairment testing for goodwill and indefinite life intangible assets at least annually even when there is no indication of impair...",
          "riskLevel": "High",
          "auditResponse": "We evaluated the appropriateness of future cash flows by comparing the Entity’s prior year expected future cash flows to the actual results to assess the Entity’s budgeting process. We assessed future..."
        },
        {
          "title": "Evaluation of the measurement of certain customer relationships, technology, and trade name acquired in the VettaFi business combination",
          "description": "On January 2, 2024, the Entity completed the acquisition of the remaining 77.7% common units in VettaFi Holdings LLC and all its subsidiaries (collectively “VettaFi”) and VettaFi became a consolidated wholly-owned subsidiary of the Entity. The Entity’s identified acquired intangible assets include c...",
          "riskLevel": "High",
          "auditResponse": "We evaluated the appropriateness of the future revenues (including those attributable to acquired customer relationships, trade name, or technology) and customer attrition rates by considering past pe..."
        }
      ]
    }
  }
}